{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/','21000000-0000-0000-0000-000000000000')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/','21000000-0000-0000-0000-000000000000')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2021-10-01-preview",
          "properties": {
            "displayName": "[concat(parameters('workspace'),' - Email Malicious Attachment Spread')]",
            "description": "Malicious Email Attachment has spread",
            "severity": "Medium",
            "enabled": false,
            "query": "EmailAttachmentInfo\r\n| where SenderFromAddress != \"\"\r\n| where isnotempty(SHA256)\r\n| join (\r\nDeviceFileEvents\r\n| project FileName, SHA256, DeviceName, DeviceId\r\n) on SHA256\r\n| project FileName, SHA256, DeviceName, DeviceId, NetworkMessageId, SenderFromAddress, RecipientEmailAddress",
            "queryFrequency": "PT5M",
            "queryPeriod": "PT5M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
            "tactics": [],
            "techniques": [],
            "alertRuleTemplateName": null,
            "incidentConfiguration": {
              "createIncident": true,
              "groupingConfiguration": {
                "enabled": false,
                "reopenClosedIncident": false,
                "lookbackDuration": "PT5H",
                "matchingMethod": "AllEntities",
                "groupByEntities": [],
                "groupByAlertDetails": [],
                "groupByCustomDetails": []
              }
            },
            "eventGroupingSettings": {
              "aggregationKind": "SingleAlert"
            },
            "alertDetailsOverride": null,
            "customDetails": null,
            "entityMappings": null,
            "sentinelEntitiesMappings": null
          }
        }
    ]
}
