{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/','68000000-0000-0000-0000-000000000000')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/','68000000-0000-0000-0000-000000000000')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "apiVersion": "2022-09-01-preview",
            "properties": {
                "displayName": "[concat(parameters('workspace'),' - Anomalous action performed in tenant by privileged user')]",
                "description": "https://techcommunity.microsoft.com/t5/microsoft-sentinel-blog/ueba-essentials-solution-now-available-in-content-hub/ba-p/3651074\nReference: https://learn.microsoft.com/en-us/azure/sentinel/ueba-reference\n\nConsider contacting user or IT responsible. The anomaly score, between 0-10 (0=benign, 10=highly anomalous).",
                "severity": "Medium",
                "enabled": true,
                "query": "BehaviorAnalytics\r\n  | where ActivityInsights.FirstTimeActionPerformedInTenant == True\r\n  | where UsersInsights.BlastRadius == 'High'\r\n  | extend AadUserId = UsersInsights.AccountObjectID"\r\n | where SourceIPAddress != "81.7.181.98",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 0,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "startTimeUtc": null,
                "tactics": [],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "AlertPerResult"
                },
                "alertDetailsOverride": null,
                "customDetails": {
                    "City": "SourceIPLocation",
                    "Activity": "ActivityInsights",
			  "InvestigationPrio": "InvestigationPriority"
                },
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "UserPrincipalName"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "SourceIPAddress"
                            }
                        ]
                    },
                    {
                        "entityType": "Host",
                        "fieldMappings": [
                            {
                                "identifier": "HostName",
                                "columnName": "SourceDevice"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": [
                    {
                        "entityType": "SentinelEntities",
                        "fieldMappings": [
                            {
                                "identifier": "Entities",
                                "columnName": "SourceIPLocation"
                            }
                        ]
                    }
                ],
                "templateVersion": null
            }
        }
    ]
}
