{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspace": {
      "type": "String"
    },
    "new-id": {
      "type": "string",
      "defaultValue": "[newGuid()]"
    }
  },
  "resources": [
    {
      "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/','00000000-0000-0000-0000-000000000006')]",
      "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/','00000000-0000-0000-0000-000000000006')]",
        "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
        "kind": "Scheduled",
        "apiVersion": "2022-09-01-preview",
        "properties": {
          "displayName": "[concat(parameters('workspace'),' - Signin without multifactor authentication')]",
          "description": "This analytic will make a MEDIUM incident, if a user logs on without MFA on a non-trusted location",
          "severity": "Medium",
          "enabled": true,
                "query": "SigninLogs | where parse_json(NetworkLocationDetails)[0].networkType != \"trustedNamedLocation\" and ConditionalAccessStatus == \"notApplied\" and AuthenticationRequirement == \"singleFactorAuthentication\" and Identity != \"CloudBackup ServiceAccount\" and ResultDescription != \"User did not pass the MFA challenge.\" and ResultDescription != \"Invalid username or password or Invalid onpremise username or password.\" and ResultDescription != \"This error occurred due to 'Keep me signed in' interrupt when the user was signing-in.\" and ClientAppUsed != \"Authenticated SMTP\" and ClientAppUsed != \"Mobile Apps and Desktop clients\" and MfaDetail == \"\"     and IPAddress != \"81.7.181.98\" //JDM Public Ip-address\r\n    and parse_json(tostring(LocationDetails.geoCoordinates)).latitude !contains \"52.3090515\" //Microsoft Datacenter location - Holland\r\n    and parse_json(tostring(LocationDetails.geoCoordinates)).longitude !contains \"4.9401898\" //Microsoft Datacenter location - Holland",
                "queryFrequency": "PT1H",
                "queryPeriod": "PT1H",
                "triggerOperator": "GreaterThan",
                "triggerThreshold": 2,
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [],
                "techniques": [],
                "alertRuleTemplateName": null,
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                        "groupByEntities": [],
                        "groupByAlertDetails": [],
                        "groupByCustomDetails": []
                    }
                },
                "eventGroupingSettings": {
                    "aggregationKind": "SingleAlert"
                },
                "alertDetailsOverride": null,
                "customDetails": null,
                "entityMappings": [
                    {
                        "entityType": "Account",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "UserPrincipalName"
                            }
                        ]
                    },
                    {
                        "entityType": "IP",
                        "fieldMappings": [
                            {
                                "identifier": "Address",
                                "columnName": "IPAddress"
                            }
                        ]
                    },
                    {
                        "entityType": "File",
                        "fieldMappings": [
                            {
                                "identifier": "Name",
                                "columnName": "AppDisplayName"
                            }
                        ]
                    }
                ],
                "sentinelEntitiesMappings": null
            }
        }
    ]
}
